{
  "id": "afghanistan",
  "flag": "af",
  "countryName": "Afghanistan",
  "title": "Afghanistan Embassy Attestation in Delhi NCR",
  "serviceType": "attestation",
  "updatedAt": "2025-05-27T17:30:10.604Z",
  "description": "\nAfghanistan attestation is a mandatory legalization process for Indian-origin documents that are to be used in Afghanistan. Whether you are applying for a work visa, family visa, student visa, or planning to start a business in Afghanistan, your documents must be authenticated by various authorities including the Ministry of External Affairs (MEA) and the Afghanistan Embassy in India.\nWe provide end-to-end support for Afghanistan embassy attestation in Delhi, covering personal, educational, and commercial documents. Our service is ideal for those seeking certificate attestation for Afghanistan, including birth certificate attestation for Afghanistan, degree attestation for Afghanistan, and commercial document attestation in Delhi NCR.\nWith our expertise in document attestation services near me, you get a seamless and transparent process. We specialize in Afghanistan attestation in Delhi NCR and ensure your documents are processed quickly and securely, saving you from the hassle of visiting government offices or embassies.\n",
  "descriptionHeading": "About Attestation",
  "requirements": [
    "Embassy attestation from India to Afghanistan handled end-to-end",
    "Delhi NCR pickup & drop included",
    "Experienced attestation consultants",
    "Prompt, verified, and secure processing"
  ],
  "requirementsHeading": "Why Choose Us",
  "process": [
    "Notary Attestation (for some personal documents)",
    "State Home Department / HRD attestation (for personal/educational docs)",
    "MEA attestation (Ministry of External Affairs)",
    "Embassy attestation from the Afghanistan Embassy in Delhi"
  ],
  "processHeading": "Attestation Process",
  "note": "(Depending on the document type, the process may slightly vary. Our experts guide you accordingly.)",
  "documentsRequired": [
    "Educational Documents",
    "Birth/Marriage/Death Certificates",
    "Business Agreements & Export Documents",
    "PCC, Medical Certificates"
  ],
  "documentsRequiredHeading": "Documents Required"
}