{
  "id": "mauritius",
  "flag": "mu",
  "countryName": "Mauritius",
  "title": "Mauritius Apostille Services in Delhi NCR",
  "serviceType": "apostille",
  "updatedAt": "2025-05-27T16:23:01.342Z",
  "description": "\nIf you're planning to move to Mauritius for higher education, work opportunities, or settling with family, you’ll need to get your Indian documents apostilled by the Ministry of External Affairs (MEA), India, as Mauritius is a member of the Hague Apostille Convention. This means that instead of embassy attestation, documents for Mauritius must carry an apostille stamp to be considered legally valid there.\nWe offer fast and reliable Mauritius apostille services in Delhi NCR, helping individuals and businesses get their documents legalized efficiently. Whether you need a birth certificate apostille for Mauritius, a degree certificate apostille, or a marriage certificate apostille for Mauritius, our experienced team ensures a smooth and hassle-free process. Our services are ideal for those looking for apostille services near me, MEA apostille for Mauritius in India, or those in urgent need of apostille for Mauritius in Delhi.\nWe understand the importance of proper documentation when it comes to immigration, job placement, or academic enrollment. With a strong focus on accuracy, compliance, and timely delivery, we are the trusted choice for all certificate apostille for Mauritius needs in Delhi NCR.",
  "descriptionHeading": "About Apostille",
  "requirements": [
    "100% reliable & MEA-authorized process",
    "Free document pickup & delivery across Delhi NCR",
    "Fast processing and customer support",
    "Apostille for all types of documents—personal, educational, and commercial"
  ],
  "requirementsHeading": "Why Choose Our Apostille Services",
  "process": [
    "Document Verification by Notary, HRD, Home Dept. (as applicable)",
    "MEA Apostille Stamp application and processing",
    "Final Document Delivery to your location"
  ],
  "processHeading": "Apostille Process",
  "note": "Mauritius does not require additional embassy attestation.",
  "documentsRequired": [
    "Birth certificates, Marriage certificates, Divorce Decree, Affidavits, etc",
    "Degree certificate, Diploma certificate, Marksheet, etc",
    "Power of Attorney, Certificate of Incorporation, Agreements, etc"
  ],
  "documentsRequiredHeading": "Documents Required",
  "processingTime": [
    "2-3 working days for most documents"
  ],
  "processingTimeHeading": "Processing Time"
}