{
  "id": "nepal",
  "flag": "np",
  "countryName": "Nepal",
  "title": "Nepal Embassy Attestation in Delhi NCR",
  "serviceType": "attestation",
  "updatedAt": "2025-05-27T17:59:13.650Z",
  "description": "\nIf you're planning to travel to Nepal for work, education, family sponsorship, or business, then getting your Indian documents attested is a crucial step. Nepal is not a member of the Hague Apostille Convention, which means Indian documents must be attested by the Embassy of Nepal in India to be legally accepted there.\nWhether you're applying for a job in Nepal, a student visa, or need to register a company or property, the Nepal embassy attestation process ensures your documents are verified and legally valid for use in Nepal. We offer comprehensive support for Nepal attestation in Delhi NCR, including birth certificate attestation, marriage certificate attestation, degree certificate attestation, and commercial document legalization.\nOur professional services are designed for individuals looking for document attestation for Nepal in Delhi, certificate attestation near me, or expert help with MEA and Nepal embassy attestation services. From document pickup to final submission, we handle everything efficiently with transparency and speed.\n",
  "descriptionHeading": "About Attestation",
  "requirements": [
    "Embassy attestation from India to Nepal handled end-to-end",
    "Delhi NCR pickup & drop included",
    "Experienced attestation consultants",
    "Prompt, verified, and secure processing"
  ],
  "requirementsHeading": "Why Choose Us",
  "process": [
    "Notary Attestation (if required)",
    "State Home Department / HRD / Chamber of Commerce Attestation",
    "MEA Attestation (Ministry of External Affairs – India)",
    "Final Attestation from the Embassy of Nepal in New Delhi"
  ],
  "processHeading": "Attestation Process",
  "note": "(Depending on the document type, the process may slightly vary. Our experts guide you accordingly.)",
  "documentsRequired": [
    "Educational Documents",
    "Birth/Marriage/Death Certificates",
    "Business Agreements & Export Documents",
    "PCC, Medical Certificates"
  ],
  "documentsRequiredHeading": "Documents Required"
}