{
  "id": "nigeria",
  "flag": "ng",
  "countryName": "Nigeria",
  "title": "Nigeria Embassy Attestation Services in Delhi NCR",
  "serviceType": "attestation",
  "updatedAt": "2025-05-27T18:07:41.813Z",
  "description": "\nPlanning to travel to Nigeria for work, education, business, or dependent visa purposes? You’ll need to get your documents attested by the Nigerian Embassy to make them legally valid for use in Nigeria. Since Nigeria is not a member of the Hague Apostille Convention, it requires a full document attestation process involving state authorities, the Ministry of External Affairs (MEA), and the Nigeria Embassy attestation in Delhi.\nIf you are searching for document attestation services for Nigeria, we provide end-to-end assistance for the complete legalization process. Whether it’s a degree certificate attestation for Nigeria, birth certificate attestation, or marriage certificate attestation, we handle it all with precision and speed. Our certificate attestation services in Delhi cover all required steps including MEA attestation, HRD attestation, and Nigeria Embassy attestation.\nOur team ensures that your documents are processed smoothly and delivered to you fully attested, saving you time and effort. Whether you’re applying for a job, student visa, or setting up a business, our attestation services near you are designed to make the process hassle-free.\n",
  "descriptionHeading": "About Attestation",
  "requirements": [
    "Embassy attestation from India to Nigeria handled end-to-end",
    "Delhi NCR pickup & drop included",
    "Experienced attestation consultants",
    "Prompt, verified, and secure processing"
  ],
  "requirementsHeading": "Why Choose Us",
  "process": [
    "Notary Attestation (if applicable)",
    "State Level Attestation (HRD for educational, Home Department for personal, Chamber of Commerce for commercial)",
    "MEA Attestation by Government of India",
    "Embassy Attestation by the Nigeria Embassy in India"
  ],
  "processHeading": "Attestation Process",
  "documentsRequired": [
    "Educational Documents",
    "Birth/Marriage/Death Certificates",
    "Business Agreements & Export Documents",
    "PCC, Medical Certificates"
  ],
  "documentsRequiredHeading": "Documents Required"
}