{
  "id": "sri-lanka",
  "flag": "lk",
  "countryName": "Sri Lanka",
  "title": "Sri Lanka Apostille Services in Delhi NCR",
  "serviceType": "apostille",
  "updatedAt": "2025-05-27T15:52:13.819Z",
  "description": "\nIf you're planning to move to Sri Lanka for employment, education, long-term stay, or family-related purposes, getting your Indian documents apostilled is a mandatory step. Sri Lanka accepts apostille documents, so there's no need for embassy attestation—your documents must be authenticated by the Ministry of External Affairs (MEA), India. We offer fast, reliable, and expert Sri Lanka apostille services in Delhi NCR to ensure a smooth and error-free process.\nWhether you're applying for a Sri Lanka employment visa, student visa, or planning to reunite with your family, you will require birth certificate apostille for Sri Lanka, degree certificate apostille, or marriage certificate apostille. Our team is highly experienced in handling personal, educational, and commercial documents, ensuring full compliance with international standards for apostille for Sri Lanka from India.\nIf you’re searching online for apostille services near me, or need MEA apostille for Sri Lanka, our Delhi-based team can assist you with quick document collection, verification, and apostille delivery. Trust our expertise for all your certificate apostille for Sri Lanka requirements at competitive pricing and with complete transparency.",
  "descriptionHeading": "About Apostille",
  "requirements": [
    "100% reliable & MEA-authorized process",
    "Free document pickup & delivery across Delhi NCR",
    "Fast processing and customer support",
    "Apostille for all types of documents—personal, educational, and commercial"
  ],
  "requirementsHeading": "Why Choose Our Apostille Services",
  "process": [
    "Pre-verification (State/SDM/Chamber of Commerce – based on document type)",
    "MEA Apostille via Ministry of External Affairs, India",
    "Final Delivery with full compliance for Sri Lanka use"
  ],
  "processHeading": "Apostille Process",
  "note":"Sri Lanka is a member of the Hague Apostille Convention, so no embassy attestation is required.",
  "documentsRequired": [
    "Birth certificates, Marriage certificates, Divorce Decree, Affidavits, etc",
    "Degree certificate, Diploma certificate, Marksheet, etc",
    "Power of Attorney, Certificate of Incorporation, Agreements, etc"
  ],
  "documentsRequiredHeading": "Documents Required",
  "processingTime": [
    "2-3 working days for most documents"
  ],
  "processingTimeHeading": "Processing Time"
}