{
  "id": "uae",
  "flag": "ae",
  "countryName": "UAE",
  "title": "UAE Embassy Attestation in Delhi NCR | Certificate & Document Attestation Services",
  "serviceType": "attestation",
  "updatedAt": "2025-05-21T10:06:50.840Z",
  "description": "\nLooking for UAE attestation in Delhi? We provide end-to-end document attestation services for individuals and businesses who need their Indian certificates validated for use in the United Arab Emirates. Whether it's for a UAE employment visa, student visa, family visa, or business purposes, our experts ensure a smooth and reliable attestation process.\n Our services include certificate attestation in Delhi, UAE Embassy attestation, and final MOFA attestation in the UAE. We handle all types of Indian documents – personal (birth, marriage, degree), educational, and commercial – through authorized channels such as the MEA (Ministry of External Affairs) and the UAE Embassy in Delhi.\nWith years of experience, we are among the most trusted attestation services near you, known for transparent pricing, fast processing, and professional handling. If you're searching for UAE Embassy attestation in Delhi or expert assistance in document attestation services, you're in the right place.",
  "descriptionHeading": "About Attestation",
  "requirements": [
    "For employment visa in UAE",
    "For higher education or student visa in UAE",
    "To sponsor family or spouse",
    "For business or company formation in UAE",
    "For resident visa or PR"
  ],
  "requirementsHeading": "Why is Attestation Required?",
  "process": [
    "Notary Attestation (Local notary verification)",
    "HRD/Home Department or SDM Attestation",
    "MEA Attestation",
    "UAE Embassy Attestation (India)",
    "MOFA Attestation (UAE – completed after document reaches UAE)"
  ],
  "processHeading": "Attestation Process",
  "documentsRequired": [
    "Original Document (Degree/Birth/Marriage/etc.)",
    "Passport Copy (Front and Back)"
  ],
  "documentsRequiredHeading": "Documents Required",
  "commonDocuments": [
    "Degree Certificate",
    "Birth Certificate",
    "Marriage Certificate",
    "Police Clearance Certificate (PCC)",
    "Medical Certificate"
  ],
  "commonDocumentsHeading": "Most Common Documents"
}