{
  "id": "vietnam",
  "flag": "vn",
  "countryName": "Vietnam",
  "title": "Vietnam Embassy Attestation in Delhi NCR",
  "serviceType": "attestation",
  "updatedAt": "2025-05-27T18:04:37.133Z",
  "description": "\nPlanning to move to Vietnam for work, study, business, or family reasons? If you're submitting Indian-issued documents in Vietnam, they must be properly legalized since Vietnam is not a member of the Hague Apostille Convention. This means your documents require Vietnam Embassy Attestation instead of apostille.\nWhether you're applying for a Vietnam employment visa, student visa, or commercial registration, your documents—educational, personal, or commercial—must go through multiple levels of verification, ending with attestation by the Embassy of Vietnam in New Delhi.\nWe specialize in Vietnam attestation services in Delhi NCR, offering fast, reliable, and affordable assistance for degree certificate attestation for Vietnam, birth and marriage certificate attestation, and business document legalization. If you're searching for Vietnam embassy attestation in Delhi, attestation services near me, or certificate attestation experts, our end-to-end support ensures a hassle-free experience.\n",
  "descriptionHeading": "About Attestation",
  "requirements": [
    "Embassy attestation from India to Vietnam handled end-to-end",
    "Delhi NCR pickup & drop included",
    "Experienced attestation consultants",
    "Prompt, verified, and secure processing"
  ],
  "requirementsHeading": "Why Choose Us",
  "process": [
    "Notary Attestation (if applicable)",
    "State HRD / Home Department / Chamber of Commerce Attestation",
    "MEA Attestation (Ministry of External Affairs – India)",
    "Final Embassy Attestation from Vietnam Embassy in New Delhi"
  ],
  "processHeading": "Attestation Process",
  "note": "The exact steps may vary depending on the type of document and state of issue. We guide you through the most efficient process",
  "documentsRequired": [
    "Educational Documents",
    "Birth/Marriage/Death Certificates",
    "Business Agreements & Export Documents",
    "PCC, Medical Certificates"
  ],
  "documentsRequiredHeading": "Documents Required"
}